#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//算术操作符
//int main()
//{
//	//操作符(运算符)
//	int a = 10 / 3;//对于除法操作符来说，如果两边都是整数，执行的是整数除法
//	double b = 10.0 / 3;//如果想计算出来的是小数，除号两端至少有一个操作符是浮点数
//	int c = 10 % 3;//取模操作符的两边必须是整数，返回整除之后的余数
//
//	printf("%d\n", a);
//	printf("%.3lf\n", b);
//	printf("%d\n", c);
//	return 0;
//}


//移位操作符(二进制)
//内存中存储的起始是补码的二进制
// << 左移操作符
// >> 右移操作符
//移位操作符的操作只能是整数
//移位的不能是正数并且要小于32


//int main()
//{
//	int a = 10;
//	//正数
//	//正数的原码，反码，补码是相同的
//	//10的二进制为1010
//	//整型占4个字节(32bit)
//	//00000000 00000000 00000000 00001010 - /原码
//	//00000000 00000000 00000000 00001010 - /反码
//	//00000000 00000000 00000000 00001010 - /补码
//
//
//    int b = -10;
//	//负数
//	//负数的原码，反码，补码是需要计算的
//	//反码也就是原码符号位（第一位）不变，其他位按位取反
//	//补码在计算上是反码加1，但是不意味着反码加1等于补码
//	//10000000 00000000 00000000 00001010 - /原码
//	//11111111 11111111 11111111 11110101 - /反码
//	//11111111 11111111 11111111 11110110 - /补码
//
//	//补码到原码的方法有两种：1.建议取反 2.取反加一
//	
//	return 0;
//}

//左翼操作符(左边丢弃，右边补零)
//int main()
//{
//	//整数
//	int a = 10;        // 00000000 00000000 00000000 00001010 - 补码
//	int b = a << 1;    // 00000000 00000000 00000000 00010100
//
//	printf("%d\n", a); //a<<1的结果是移位之后的效果，a的值不变
//	printf("%d\n", b);
//
//
//	//负数
//	int c = -10;       // 11111111 11111111 11111111 11110110 - 补码（c）
//	int d = c << 1;    // 11111111 11111111 11111111 11101100 - 补码（d）
//                     // 10000000 00000000 00000000 00010100 - 原码（d）
//
//	printf("%d\n", c);  
//	printf("%d\n", d); //打印出来的是原码
//	return 0;
//}

//左翼操作符
//1.算术右移（常见）:右边丢弃，左边补原来的符号位
//2.逻辑右移：右边丢弃，左边补零
//int main()
//{
//	int a = -1;
//	// 10000000 00000000 00000000 00000001
//	// 11111111 11111111 11111111 11111110
//	// 11111111 11111111 11111111 11111111
//
//	int b = a >> 1;
//
//	printf("%d\n", b);
//	return 0;
//}