#define _CRT_SECURE_NO_WARNINGS

//一维及二维数组的初始化，当初始化时可以缺省元素个数。
//对于二维数组只能缺省行数。
//初始化遵循的规则是从左至右依次，初值个数不能超过数组容量；



//数组的首元素地址：表示数组的首个元素的地址。
//数组的地址：表示整个数组的首地址。

/*
#include<stdio.h>
int main()
{
	int arr[5] = { 0 };
	printf("%d\n", sizeof(arr));
	printf("arr = %d\n", arr);//数组的首元素地址
	printf("arr = %d\n", &arr[0]);//数组的首元素地址
	printf("&arr = %d\n", &arr);//数组的首地址

	printf("---------------------------------\n");

	printf("arr = %d\n", arr + 1);//数组的首元素地址+1，相当于printf("arr = %d\n",& arr[1]);
	printf("&arr[0] = %d\n", &arr[0] + 1);//数组的首元素地址+1
	printf("&arr = %d\n", &arr + 1);//数组的首地址+1
	return 0;
}
*/


//注意：
//只有使用“& 数组名”时，才是取数组首地址；直接打印数组名或者& 数组名[0]都是取得数组首元素地址。
//首地址 + 1得到的是跳过整个数组的地址，首元素地址 + 1得到的是下一个元素的地址。



/*
#include<stdio.h>
int main()
{
	int arr[3][4] = { 0 };
	printf("%d\n", sizeof(arr));
	printf("二维数组地址：%d\n", arr);
	printf("二维数组地址：%d\n", &arr);
    printf("一维数组地址：%d\n", arr[0]);
	printf("一维数组地址：%d\n", &arr[0]);
	printf("一维数组首元素地址：%d\n", &arr[0][0]);
	printf("---------------------------------\n");
	printf("二维数组地址：%d\n", &arr + 1);//+48
	printf("一维数组地址：%d\n", &arr[0] + 1);//+16
	printf("一维数组首元素地址：%d\n", &arr[0][0] + 1);//+4
    return 0;
}
*/



//二维数组中：
//"&数组名"表示这个数组的首地址。
//“数组名”与"&数组名[0]”表示的是数组的首元素地址，要注意的是，这个首元素地址是第一个元素数组的首地址。


/*
#include<stdio.h>
int main()
{
    //数组元素之间的地址是相连的
    int a[5] = { 10,20,30,40,50 };
    int* p;
    int i = 0;
    printf("a[0]的地址：%d\n",&a[0]);
    printf("a[1]的地址：%d\n",&a[1]);        
    printf("a[2]的地址：%d\n",&a[2]);
    printf("a[3]的地址：%d\n",&a[3]);
    printf("a[4]的地址：%d\n",&a[4]);
    printf("---------------------------------\n");
    printf("a代表的地址：%d\n", a );//数组名代表数组的首地址（首元素地址），即&a[0]
    printf("a+1代表的地址：%d\n", a + 1); //即& a[1]
    printf("a+2代表的地址：%d\n", a + 2);
    printf("a+3代表的地址：%d\n", a + 3);
    printf("a+4代表的地址：%d\n", a + 4);
    printf("---------------------------------\n");
    printf("a[1]+3的地址：%d\n", &a[1]+3);//即a[4]的地址
    printf("---------------------------------\n");
    printf("*(a+3)代表的值：%d\n", *(a + 3));//*后面跟着的是哪个变量的地址，则代表着该变量本身，即a[3]
    printf("---------------------------------\n");
    printf("*a+3代表的值：%d\n", *a + 3);//即a[0]+3=13
    return 0;
}
*/


/*
#include<stdio.h>
int main()
{
    //数组元素之间的地址是相连的
    int a[5] = { 10,20,30,40,50 };
    int* p;//指针变量p
    int i = 0;
    printf("a代表的地址：%d\n", a);//数组名代表数组的首地址（首元素地址），即&a[0]
    printf("a+1代表的地址：%d\n", a + 1); //即& a[1]
    printf("a+2代表的地址：%d\n", a + 2);
    printf("a+3代表的地址：%d\n", a + 3);
    printf("a+4代表的地址：%d\n", a + 4);
    printf("a[1]+3的地址：%d\n", &a[1] + 3);//即a[4]的地址
    printf("---------------------------------\n");
    p = a;//相当于p=&a[0];
    printf("p代表的地址：%d\n", p);
    printf("p+1代表的地址：%d\n", p + 1); 
    printf("p+2代表的地址：%d\n", p + 2);
    printf("p+3代表的地址：%d\n", p + 3);
    printf("p+4代表的地址：%d\n", p + 4);
    printf("---------------------------------\n");
    p = &a[2];//p是指针变量，可以修改，相当于p=&a[2];
    printf("p代表的地址：%d\n", p);
    printf("p+1代表的地址：%d\n", p + 1); //即&a[2]
    printf("p+2代表的地址：%d\n", p + 2);//即&a[3]
    printf("p+3代表的地址：%d\n", p + 3);
    printf("p+4代表的地址：%d\n", p + 4);
    printf("---------------------------------\n");
    //a = &a[2];地址是常量，不能修改
    return 0;
}
*/



/*
#include<stdio.h>
int main()
{
    //数组元素之间的地址是相连的
    int a[5] = { 10,20,30,40,50 };
    int* p;//指针变量p
    p = &a[2];
    printf("p[0]的值：%d\n", p[0]);//即a[2]
    printf("p[1]的值：%d\n", p[1]);//即a[3]
    printf("p[5]的值：%d\n", p[5]);
    printf("---------------------------------\n");
    p = a;
    printf("%d\n",*p);//a[0]
    p++;//p=p+1=&a[1]
    printf("%d\n", *p);//a[1]
    printf("%d\n", *a);//a[0]
    //a++;错误，a++=a+1,a是地址不可修改
    printf("---------------------------------\n");
    printf("%d\n", *p++);//都是第二优先级，右结合，为20，即a[1]的值，p=p+1=&a[2]
    printf("%d\n", *p);//30,即a[2]
    printf("%d\n", ++*p);//31
    return 0;
}
*/



/*
#include<stdio.h>
int main()
{
    char a[3][4] = { {1,2,3,4},{5,6,7,8},{2,4,6,8} };
    //a[1][2]的地址的表示方法
    printf("%d\n", &a[1][2]);//&a[i][j]
    printf("%d\n", a[1] + 2);//a[i]+j
    printf("%d\n", *(a+1)+2);//*(a+i)+j
    printf("%d\n", &a[0][0] + 4*1 + 2);//&a[0][0] + 4*i + j
    printf("%d\n", a[0] + 4*1 + 2);//a[0] + 4*i + j
    return 0;
}
*/



//&a表示二维数组地址，绑定一个二维数组
//a表示首行地址，绑定一行
//&a[0]表示首行地址，绑定一行
//a[0]表示首行首元素地址，绑定一个元素
//a[0][0]表示首行首元素的值
//&a[0][0]表示首行首元素的地址，绑定一个元素



/*
#include<stdio.h>
#define M 3
#define N 4
int main()
{
    int a[M][N] =
    {
        {1,2,3,4},
        {5,6,7,8},
        {2,4,6,8}
    };
    int* p;//绑定一个变量的地址
    //p=a;错误，a绑定的是一行
    p = &a[0][0];//相当于p=a[0];
    printf("%d\n",* p);
    
    int(*p2)[N];//定义了一个行指针，是指针变量，只能存放长度为N的int型数组的地址，绑定的是一行
    //p2 = &a[0][0];//错误
    p2 = a;//相当于p2=a[0],绑定的是第零行
    printf("\n\n");
    printf("p代表的地址：%d\n", p);
    printf("p2代表的地址：%d\n", p2);
    printf("\n\n");
    //printf("%d\n", *(*(p+1)+1));//错误，p是普通的指针变量，不是行指针
    printf("%d\n", *(*(p2 + 0) + 0));//行指针可以这样用
    printf("%d\n", p2[0][0]);//行指针可以这样用
    printf("\n\n");
    p = p + 1;
    p2 = p2 + 1;
    printf("p代表的地址：%d\n", p);
    printf("p2代表的地址：%d\n", p2);

    int* p3[M];//定义了一个指针数组，长度为M，相当于定义了M个指针变量
    return 0;
}
*/

